Revit 2024 API
RebarConstraint.IsToCover Method
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsToCover()
Visual Basic
Public Function IsToCover As Boolean
Visual C++
public:
bool IsToCover()
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace